





/*
 * SHARED STRINGS
 */

/*
 * ./ShadowsocksX-NG/UserRulesController.swift
 */

"PAC has been updated by User Rules." = "PAC has been updated by User Rules.";

"It's failed to update PAC by User Rules." = "It's failed to update PAC by User Rules.";

/*
 * ./ShadowsocksX-NG/AppDelegate.swift
 */

"Global Mode" = "Global Mode";

"Manual Mode" = "Manual Mode";

"Auto Mode By PAC" = "Auto Mode By PAC";

"Shadowsocks: On" = "Shadowsocks: On";

"Shadowsocks: Off" = "Shadowsocks: Off";

"Export Command Copied." = "Export Command Copied.";

"Save Diagnosis to File" = "Save Diagnosis to File";

"Servers" = "Servers";

"Turn Shadowsocks Off" = "Turn Shadowsocks Off";

"Turn Shadowsocks On" = "Turn Shadowsocks On";

"By scan QR Code" = "By scan QR Code";

"By handle SS URL" = "By handle SS URL";

"By import from pasteboard" = "By import from pasteboard";

"Add \(addCount) Shadowsocks Server Profile" = "Add \(addCount) Shadowsocks Server Profile";

"Not found valid QRCode of shadowsocks profile" = "Not found valid QRCode of shadowsocks profile";

"Not found valid URL of shadowsocks profile" = "Not found valid URL of shadowsocks profile";

/*
 * ./ShadowsocksX-NG/ShareServerProfilesWindowController.swift
 */

"Save QRCode As File" = "Save QRCode As File";

"Save All Server URLs To File" = "Save All Server URLs To File";

/*
 * ./ShadowsocksX-NG/PACUtils.swift
 */

"PAC has been updated by latest GFW List." = "PAC has been updated by latest GFW List.";

"Failed to download latest GFW List." = "Failed to download latest GFW List.";

/*
 * ./ShadowsocksX-NG/ImportWindowController.swift
 */

"Success to add \(addCount) server." = "Success to add \(addCount) server.";

"Not found valid shadowsocks server urls." = "Not found valid shadowsocks server urls.";

/*
 * ./ShadowsocksX-NG/PreferencesWindowController.swift
 */

"New Server" = "New Server";

/*
* ./ShadowsocksX-NG/TenonMainWindowsController.swift
*/

"Smarte Route" = "Smarte Route";
"Tenon p2p protecting your IP and privacy." = "Tenon p2p protecting your IP and privacy.";
"SETTINGS" = "SETTINGS";
"UPGRADE" = "UPGRADE";
"Already the latest version." = "Already the latest version.";
"There is an updated version, in order to ensure that your network is smooth, download the latest version." ="There is an updated version, in order to ensure that your network is smooth, download the latest version."
"ACCOUNT SETTING" = "ACCOUNT SETTING";
"Private Key" = "Private Key";
"Account Address" = "Account Address";
"Balance" = "Balance";
"Transactions" = "Transactions";
"waiting server" = "waiting server...";

"Agent service is not supported in your country or region." = "Agent service is not supported in your country or region.";
"Free 100M/day used up, buy tenon or use tomorrow." = "Free 100M/day used up, buy tenon or use tomorrow.";
"Free 100M/day" = "";
"Connect p2p vpn network failed." = "Connect p2p vpn network failed.";
"Your account is logged in elsewhere." = "Your account is logged in elsewhere.";
"VIP " = "VIP ";
"days" = " days";
"after success reset private key, must restart program." = "after success reset private key, must restart program.";
"copy sharing link succeeded." = "copy sharing link succeeded.";
"Decentralized VPN, safe, reliable and high speed." = "Decentralized VPN, safe, reliable and high speed.";

"Share"="Share";
"Settings"="Settings";
"Third Node Join"="JoinUs";
"Third-party node access, one-click startup, and access to the decentralized Tenon VPN network to provide services and routing"="Third-party node access, one-click startup, and access to the decentralized Tenon VPN network to provide services and routing";
"Language"="Language";
"TG"="TG";
"Email"="Email";
"Upgrade"="Upgrade";
"Cancel"="Cancel";
"Skip Ads"="";
"Failed to initialize P2P network, please try again!"="Failed to initialize P2P network, please try again!";
"Withdraw"="Withdraw";
"Destination Tenon Address"="Destination Tenon Address";
"Type or paste address"="Type or paste address";
"Count"="Count";
"private_key_notices"="Tip: in order to ensure security, please keep your private key, do not tell anyone, to ensure the security of your account";
"Allow to seel"="Allow to seel";
"Minimum Count 100"="Minimum Count 100";
"Seel out all"="Seel out all";
"Tip: At least 100 Tenon can be mentioned. For security, please keep your private key and don't tell anyone to ensure your account is safe."="Tip: At least 100 Tenon can be mentioned. For security, please keep your private key and don't tell anyone to ensure your account is safe.";
"History"="History";
"Expired"="Expired";
"Earn"="Earn";
"Transfer to your account"="Transfer to your account";
"Way 1"="Way 1";
"Way 2"="Way 2";
"Way 3"="Way 3";
"Way 4"="Way 4";
"Way 5"="Way 5";
"Method seven"="Way 6";
"Buy"="Buy";
"time"="time";
"amount"="amount";
"Balance"="bal";
"To VPN"="To VPN";
"ad_reward_info"="watched ad earned 3~10 tenon";
"Ad is not ready."="Ad is not ready, retry later.";
"exit_and_retry"="network is not ready, retry or exit app to retry.";
"Tran Out"="Trans Out";
"Tran In"="Tran In";
"Share Reward"="Share Reward";
"Ad Reward"="Ad Reward";
"Transfer Tenon directly to your anonymous account"="";
"Copy"="Copy";
"Monthly/Quarterly/Annual"="Monthly/Quarterly/Annual";
"Fast"="Fast";
"Watch ads to earn Tenon"="Watch ads to earn Tenon";
"Go"="Go";
"Copy success!"="Copy success!";
"United States"="United States";
"China"="China";
"Singapore"="Singapore";
"Japan"="Japan";
"South Korea"="South Korea";
"Canada"="Canada";
"France"="France";
"England"="England";
"Germany"="Germany";
"Australia"="Australia";
"Brazil"="Brazil";
"Netherlands"="Netherlands";
"Hong Kong"="Hong Kong";
"India"="India";
"Russia"="Russia";
"Anonymous User"="Account";
"Private key"="Private key";
"Free"="Free";
"Higher performance"="Best Experience";
"Disconnect"="Disconnect";
"Connected"="Connected";
"P2P networks are protecting your IP and data privacy"="P2P networks are protecting your IP and data privacy";
"Community"="Community";
"Professional"="Professional";
"Total"="Total";
"Enter private key"="Enter private key";
"Enter the 64-bit private key"="Enter the 64-bit private key钥";
"OK"="OK";
"nodes"="nodes";
"Linking for you"="Linking for you";
"About"="About     |";
"Telegram"="Telegram";
"Join the node\nThird-party node access, one-click startup, and access to the decentralized Tenon VPN network to provide services and routing\nhttps://github.com/tenondvpn/tenonvpn-join\n\nDisclaimer\nTenon VPN is composed of a large number of decentralized nodes, because there is no centralized server, thus avoiding the authority of centralization, that is, you can access the network without any blocking.\n\nTechnical Solutions\n1. Tenon VPN is composed of a large number of decentralized nodes, because there is no centralized server, thus avoiding the authority of centralization, that is, you can access the network without any blocking.\n\n2. Although Tenon VPN is decentralized, its performance is superior to a centralized VPN server because TenonVPN provides an original intelligent route that can find the best communication route through the user's current network conditions.\n\n3. Tenon VPN is decentralized. All user data is encrypted by the user's private key. At the same time , the addition of the intelligent routing network ensures the client's anonymity in the entire decentralized world.\n\n4. With a powerful P2P network and secure encryption technology, Tenvon VPN acts as a routing node through the user's home PC, making blocking impossible.\n\n5. Tenon VPN is easy to use, requires no complicated configuration, and can be safely, quickly and reliably entered into the decentralized world with one-click connection."="Join the node\nThird-party node access, one-click startup, and access to the decentralized Tenon VPN network to provide services and routing\nhttps://github.com/tenondvpn/tenonvpn-join\n\nDisclaimer\nTenon VPN is composed of a large number of decentralized nodes, because there is no centralized server, thus avoiding the authority of centralization, that is, you can access the network without any blocking.\n\nTechnical Solutions\n1. Tenon VPN is composed of a large number of decentralized nodes, because there is no centralized server, thus avoiding the authority of centralization, that is, you can access the network without any blocking.\n\n2. Although Tenon VPN is decentralized, its performance is superior to a centralized VPN server because TenonVPN provides an original intelligent route that can find the best communication route through the user's current network conditions.\n\n3. Tenon VPN is decentralized. All user data is encrypted by the user's private key. At the same time , the addition of the intelligent routing network ensures the client's anonymity in the entire decentralized world.\n\n4. With a powerful P2P network and secure encryption technology, Tenvon VPN acts as a routing node through the user's home PC, making blocking impossible.\n\n5. Tenon VPN is easy to use, requires no complicated configuration, and can be safely, quickly and reliably entered into the decentralized world with one-click connection.";
"Join the node"="Join the node";
"Click modify settings"="Click Modify Settings";
"Join"="Join";
"Buy Success"="Buy Success";
"your phone cannot IAP"="your phone cannot IAP";
"no product"="no product";
"order failed"="Order Failed";
"smart_route"="Smart Route";
"global_route"="Global Route";
"Join Nodes"="Join the node";
"proxy pattern"="Proxy Pattern";
"Share to earn"="Share to earn";
"History"="History";
"MONTHLY                    $5"           ="MONTHLY                    $5";
"QUARTERLY                  $12 / -20%"   ="QUARTERLY                  $12 / -20%";
"ANNUAL           $36 / -40%" ="ANNUAL           $36 / -40%";
"Disclaimer"="Disclaimer";
"Technical Solutions"="Technical Solutions";
"About Tenon VPN"="About TenonVPN";
"Official website"="Mainnet";
"invalid private key."="invalid private key.";
"Set up to 3 private keys."="Set up to 3 private keys.";
"after success reset private key, must restart program."="after success reset private key, must restart program.";
" DAYS"=" DAYS";
"success, now should reconnet vpn."="success, now should reconnet vpn.";
"recharge"="recharge";
"paying"="The last purchase has not been confirmed";
"The light of Blockchain Apps"="The Light of Blockchain Apps";
"Decentralization VPN"="Decentralized VPN";
"Fast"="Fast";
"Safe"="Safe";
"Reliable"="Reliable";
"Easy"="Easy";
"OutBandwidth"="The traffic has run out today.";
"TenonOver"="Tenon Over";
"use tomorrow"="use tomorrow";
"success" = "Success";
"copy success" = "Copy success!";
"GO"="Join";
"Settings"="Settings";
"Join Node"="Join Node";
"join_desc"="
Third-party node access, one-click startup, and access to the decentralized Tenon VPN network to provide services and routing";
"email"="Email";
"Site"="Site";
"TG"="TG";
"Tips: To ensure security, please keep your private key and don’t tell anyone to ensure your account is safe"="Tips: To ensure security, please keep your private key and don’t tell anyone to ensure your account is safe";
"Support"="Support";
